---
kind: property
id: P:Autodesk.Revit.DB.MEPSystem.Elements
zh: 系统
source: html/c1cb0808-3b81-87a5-b804-84a733686f2d.htm
---
# Autodesk.Revit.DB.MEPSystem.Elements Property

**中文**: 系统

Terminal elements in the system.

## Syntax (C#)
```csharp
public ElementSet Elements { get; }
```

## Remarks
The return value is a read only collection and doesn't include the base equipment or panel.